Repository: gpz500/minesweeptk
Catalog: *.po
Languages: it, ja

source: Bomb! Game over...
it: Bomba! Gioco finito...

source: You won!!!
it: Hai vinto!!!
ja: ＹＯＵ ＷＯＮ！！！

source: You lost!
it: Hai perso!
ja: ＹＯＵ ＬＯＳＴ！

source: You lost... What do you want to do?
it: Hai perso... Cosa vuoi fare?
ja: ＹＯＵ ＬＯＳＴ 次は何をしますか。

source: Exit
it: Esci
ja: 終了

source: Replay this game
it: Rigioca questa partita
ja: 前回のゲームはもう一度

source: Play a new game
it: Gioca una nuova partita
ja: 新しいゲームにする

source: You Won!
it: Hai vinto!
ja: ＹＯＵ ＷＯＮ！

source: You won... What do you want to do?
it: Hai vinto... Cosa vuoi fare?
ja: ＹＯＵ ＷＯＮ 次は何をしますか。

source: 1 remaining mine
it: 1 mina rimanente
ja: 地雷は後一つです！

source: %d remaining mines
it: %d mine rimanenti
ja: 後%d地雷があります。

source: Options
it: Opzioni
ja: オプション

source: Choose table size and start a new game:
it: Scegli le dimensioni della tabella e inizia una nuova partita:
ja: テーブルのサイズを選び、新しいゲームを始まる。

source: 9 x 9, 10 mines
it: 9 x 9, 10 mine
ja: 9 x 9, 地雷１０個

source: 16 x 16, 40 mines
it: 16 x 16, 40 mine
ja: 16 x 16, 地雷４０個

source: 16 x 30, 99 mines
it: 16 x 30, 99 mine
ja: 16 x 30, 地雷９９個

source: Custom
it: Personalizzato
ja: 自定義

source: Height (9-24):
it: Altezza (9-24):
ja: 高さ(9-24):

source: Width (9-30):
it: Larghezza (9-30):
ja: 横幅(9-30):

source: Mines (10-668):
it: Mine (10-668):
ja: 地雷数(10-668):

source: %s Help
it: Aiuto di %s
ja: %s ヘルプ

source: Hello, this is a very simple minesweeper game. The game rules are simple: 1) you have to discover all cells without mine to win; 2) if you discover a cell with a mine, you loose. To discover a cell, click on it with the mouse. In order to simplify your task, every cell you discover indicates the number of mines in the adjacent cells. You can also mark cells with a flag or a question mark (?) to remember your hypothesis: every time you right click (or Control+click) on an covered cell you cycle between 'unmarked' --> 'flagged' --> 'question mark' stati. Double clicking on an uncovered cell, uncovers all the non-flagged adjacent cells or flags them, depending on the case. Explore the File menu to find some useful command! Enjoy!
it: Ciao, questo è un Campo minato molto semplice. Le regole del gioco sono: 1) per vincere devi scoperchiare tutte le celle senza una mina; 2) se scoperchi una cella con una mina, perdi. Per scoperchiare una cella, fai click sulla cella con il mouse. In modo da semplificarti il compito, ogni cella che scoperchi ti indica il numero di mine contenute nelle celle adiacenti. Puoi anche marcare le celle con una bandierina o un punto interrogativo (?) per annotare le tue ipotesi: ogni volta che fai click con il tasto destro del mouse (oppure Control+Click) su una cella coperta ciclerai tra gli stati 'non marcata' --> 'con bandierina' --> 'punto interrogativo'. Doppio-click su una cella scoperta scopre tutte le celle adiacenti non segnalate da una bandierina oppure piazza una bandierina sulle celle adiacenti, a seconda dei casi. Esplora il menù File per scoprire alcuni utili comandi! Divertiti!

source: Close
it: Chiudi
ja: 閉じる

source: New game
it: Nuova partita
ja: 新しいゲーム

source: Load
it: Carica
ja: ロード

source: Save
it: Salva
ja: 保存

source: Options...
it: Opzioni...
ja: オプション...

source: Quit
it: Esci
ja: 中止

source: Help
it: Aiuto
ja: ヘルプ

source: %s Help...
it: Aiuto di %s...
ja: %s ヘルプ...

source: About %s
it: Informazioni su %s
ja: %s について

source: Are you shure you want to quit?
it: Sei sicuro di voler uscire?
ja: 本当に終了してもよろしいですか？

source: %s v%s A minesweeper game in Python and Tk written by Alessandro Morgantini <gpz500@technologist.com> Homepage: https://www.morgantini.org/ Copyright (C) 2012-2019 Alessandro Morgantini Released under the terms of GPLv3 (https://www.gnu.org/licenses/gpl.html)
it: %s v%s Un gioco di Campo minato in Python e Tk scritto da Alessandro Morgantini <gpz500@technologist.com> Homepage: https://www.morgantini.org/ Copyright (C) 2012-2019 Alessandro Morgantini Rilasciato nei termini della GPLv3 (https://www.gnu.org/licenses/gpl.html)
ja: %s v%s PythonとTkの掃海艇ゲーム Alessandro Morgantini <gpz500@technologist.com>によって書かれました。 ホームページ：https://www.morgantini.org/ 著作権（C）2012-2019アレッサンドロモルガンティーニ GPLv3の条件でリリース （https://www.gnu.org/licenses/gpl.html）

source: Hello, this is a very simple minesweeper game. The game rules are simple: 1) you have to discover all cells without mine to win; 2) if you discover a cell with a mine, you loose. To discover a cell, click on it with the mouse. In order to simplify your task, every cell you discover indicates the number of mines in the adjacent cells. You can also mark cells with a flag or a question mark (?) to remember your hypothesis: every time you right click (or Control+click) on a covered cell you cycle between 'unmarked' --> 'flagged' --> 'question mark' stati. If there isn't any ambiguity, clicking on a cell with a number uncovers or, depending on the case, flags all the covered adjacent cells. Explore the File menu to find some useful command! Enjoy!
ja: こんにちは、これは非常に単純な掃海艇ゲームです。 ゲームのルールは簡単です： 1）あなたは勝つために私のいない全ての細胞を発見しなければなりません。 2）あなたが私のいる細胞を発見した場合、あなたは失います。 セルを見つけるには、マウスでそれをクリックしてください。 あなたの仕事を簡単にするために、あなたが発見するすべての細胞 隣接セル内の地雷の数を示します。 セルにフラグまたは疑問符（？）を付けることもできます。 あなたの仮説を思い出すために：あなたが正しい時はいつでも 切り替えるセルの上をクリック（またはControlキーを押しながらクリック）します ‘unmarked’ - > ‘flagged’ - > ‘クエスチョンマーク’ stati。 あいまいさがない場合は、数字の付いたセルをクリックしてください。 ケースに応じて、カバーされていないものすべてにフラグを立てる 隣接セル [ファイル]メニューを調べて、便利なコマンドを見つけてください。 楽しい！

source: File
ja: ファイル
